In [8]:
import psycopg2 as pg
import pandas as pd
from sqlalchemy import create_engine

conn = pg.connect(dbname='postgres', user='postgres', password='root', port=5432)
cursor = conn.cursor()

In [9]:
file_path = 'hw1_data.xlsx'
xlsx = pd.ExcelFile(file_path)

df_transaction = pd.read_excel(xlsx, 'transaction')
df_customer = pd.read_excel(xlsx, 'customer')

df_customer.head()

,customer_id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Talbot,NaN,Male,1961-10-03 00:00:00,NaN,IT,Mass Customer,N,No,17979 Del Mar Point,2448,New South Wales,Australia,4
4,5,Sheila-kathryn,Calton,Female,1977-05-13 00:00:00,Senior Editor,NaN,Affluent Customer,N,Yes,9 Oakridge Court,3216,VIC,Australia,9

In [10]:
df_transaction.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,2,2950,2017-02-25,False,Approved,Solex,Standard,medium,medium,71.49,53.62
1,2,3,3120,2017-05-21,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92
2,3,37,402,2017-10-16,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82
3,4,88,3135,2017-08-31,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10
4,5,78,787,2017-10-01,True,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48

In [7]:
def upload_xlsx_to_db():
    engine = create_engine('postgresql://postgres:root@localhost:5432/postgres')
    conn = engine.raw_connection()
    df_transaction.to_sql('transaction_tmp', con=engine, index=True, if_exists='replace')
    df_customer.to_sql('customer_tmp', con=engine, index=True, if_exists='replace')
    conn.commit()
upload_xlsx_to_db()

In [4]:
# Создаем справочники из таблицы customer
items = ["job_title", "job_industry_category", "wealth_segment", "country", "gender"]
for item in items:
    cursor.execute(f"""create table {item} as 
        select ROW_NUMBER() over() as id, {item} name from
        (
            select distinct {item} 
            from customer_tmp 
            where {item} is not null
        ) x""")

In [5]:
# Создаем справочники из таблицы transaction
items = ["order_status", "brand", "product_line", "product_class", "product_size"]
for item in items:
    cursor.execute(f"""create table {item} as 
        select ROW_NUMBER() over() as id, {item} name from
        (
            select distinct {item} 
            from transaction_tmp 
            where {item} is not null
        ) x""")

In [6]:
conn.commit()